Tekla.Structures.Filtering.Categories.PartFilterExpressions.Name
The Name class represents the name filter expression.

Tekla.Structures.Filtering.Categories.PartFilterExpressions.Name.#ctor
Initializes a new instance of the Name class.